; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.9.0
; Author:	Maslak66 <maslak1966@gmail.com>
; Homepage:
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	Save the file in Unicode format (UTF-16) and Zip it to preserve formatting
;	E-mail new language files to gora@7zsfx.info for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents of each %s variable is hardcoded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
1=Plik
2=Opcje
3=Pomoc
4=Sprawdź najpierw jako archiwum SF&X
; ------------------------------------
5=Wybierz plik
6=A&rchiwum/Instalator do wypakowania:
7=Wybierz folder
8=&Folder docelowy:
9=Na tę kartę można przeciągnąć i upuścić plik
; ------------------------------------
10=%s Opcje
11=Zapisz &historię
12=Ukryj okno &konsoli
13=Pr&oponuj aktualizacje:
14=&Język:
15=Zapa&miętaj i nie zmieniaj rozmiaru okna
16=&Nie zamykaj okna po wypakowaniu
; ------------------------------------
17=Specjalne opcje formatu
18=Monituj przed uruchomieniem plikó&w
19=&Usuń zduplikowane pliki
20=Usuń pliki t&ymczasowe
21=Dodaj brakujące rozszerzenie do &plików
22=Usuń plik po udanym wypakowan&iu
; ------------------------------------
23=O programie
; ------------------------------------
24=Strona domowa %s
25=Strona oficjalnej wersji
26=Forum zmodyfikowanej wersji
; ------------------------------------
27=Aktualizacja
28=Ostatnia aktualizacja programu była %s dni temu!
29=Sprawdzić czy są dostępne aktualizacje?
30=Inte&gruj z powłoką
; ------------------------------------
31=Wyodrę&bnij
32=Zapi&sz
33=Ak&tualizuj
34=&Anuluj
35=Ustawienia
; ------------------------------------
36=Wypakowywanie %s
37=%s obsługuje następujące metody wypakowywania %s pakietów.%nNiestety, żadna z tych metod nie jest w 100% niezawodna.%nJeśli domyślna metoda nie działa, należy ponownie uruchomić %s i wybrać alternatywną metodę.
; ------------------------------------
38=Metoda wypakowywania
39=%s instalacja administracyjna
40=%s wypakowywanie
41=%s przełącznik
42=%s dekompresor
43=Instalator inny niż InstallShield
44=Pokaż podsumowani&e po rozpakowaniu
; ------------------------------------
; GUI control functions
45=Wyłącz &dźwięki w programie
46=Wersja 7-Zip
47=Plik nie istnieje:%n%s%nProszę, wybierz istniejący plik.
48=Otwórz plik
49=Zapisz do
50=Wszystkie
; Common terms
51=archiwum
52=skompresowany plik
53=Czas: %s
54=ebook
55=ecard
56=zaszyfrowany plik
57=nieznany plik wykonywalny
58=Zainicjowanie nie powiodło się
59=plik pomocy
60=poprawka
61=obraz
62=instalator
63=moduł łączenia
64=spakowany
65=łatka
66=Samorozpakowujący
67=etap
68=Inicjowanie powiodło się
69=Testowanie
70=Wyodrębnianie:
71=Rozmiar archiwum
72=aktualizacje
73=Nazwa archiwum
74=co tydzień|co 2 tygodnie|co miesiąc|nigdy
; Status messages
75=Skanowanie pliku w celu ustalenia rodzaju pliku
76=Skanowanie pliku z %s skanowaniem
77=Wypakowywanie plików z:
78=Oczekiwanie na uruchomienie instalatora.%nProszę czekać
79=By przerwać wypakowywanie naciśnij klawisz ESC%nMinimalizuj/Przywróć okno przez naciśnięcie klawisza F11
; Custom prompts
80=Obraz %s nie może zostać wypakowany bezpośrednio. Zamiast tego obraz %nzostanie przekonwerterowany do formatu ISO CD-ROM a następnie wypakowany.%n%nCzy chcesz kontynuować?%nUwaga: Ten proces może zająć kilka minut.
81=Błąd:  Obraz CD-ROM nie może być przekonwertowany.
82=Błąd:  Obraz ISO został utworzony z obrazu %s, ale nie mógł być wypakowany.%nCzy chcesz zachować obraz ISO do późniejszej analizy?
83=Błąd: To nie wydaje się być prawidłowy plik MHT.%nNie udało się wykryć granicy.
84=Rozpoczęcie %s. Proszę wyjść z instalatora i kliknąć OK aby kontynuować.
85=Uwaga: Ta metoda działa tylko z niektórymi pakietami Wise for Windows Installer.%nGdy Wise Installation Wizard jest uruchomiony i oczekuje na dane, plik ten nie jest obsługiwany.%nProszę wyłączyć instalator i %s zakończyć rozpakowywanie.%n%nCzy chcesz kontynuować?
86=Ten plik jest spakowany z kompresją %s. Nadal można wyodrębnić bez wypakowywania %s lub wykonać tylko %s wypakowanie.%n%nKliknij "Tak", aby wyodrębnić bez rozpakowywania %s.%n%nKliknij "Nie", aby uruchomić tylko wypakowanie %s.%n%nW tym ostatnim przypadku, rozpakowany plik będzie miał nazwę:%n%s
87=Błąd: %s%nNie można wypakować.
88=Ostrzeżenie: Aby wypakować pliki tego typu, plik musi zostać uruchomiony bezpośrednio. Jeśli bedziesz kontynuował, następująca komenda zostanie wykonana %n%n%s%n%n. Jeśli uważasz, że ten plik może zawierać złośliwe oprogramowanie, zalaca się anulowanie tej akcji.n% Czy chcesz kontynuować wypakowanie?
89=Ostrzeżenie: Katalog docelowy %s już istnieje!%nWydobycie w niepuste folderu może prowadzić do rozpakowywania błędu.%n%nAby wyczyścić folder przed rozpakowaniem?
90=Potrzebne jest hasło do rozpakowania!%n%nUsuń zaznaczenie pola wyboru '%s'%naby móc wprowadzić hasło.
91=Do rozpakowania tego archiwum potrzebny jest dodatkowy%ndepaker %s
; Help text
92=Wyodrębnianie plików z archiwum lub instalatora dowolnego typu.%nUżycie:%n%s%n%nObsługiwane argumenty:%n%s%t%tWyświetl informacje pomocy%n%s%t%tOtwórz zakładkę %s%n%s%tNazwa pliku do wypakowania%n%s%tKatalog do którego będzie wypakowywanyt%n%nPrzekazywanie %s zamiast nazwy katalogu docelowego%n%s aby wyodrębnić do podkatalogu o nazwie archiwum.%n%nPrzykład:%s%n%nUruchomienie %s bez argumentów spowoduje wyświetlenie okna, w którym można określić nazwę pliku i katalog docelowy.
93=Wyodrębnij używając %s
; Error messages
94=Wypakowywanie %s nie może być zapisane w pliku dziennika
95=przez archiwizator 7-Zip
96=%s nie może być wypakowany.%nTyp pliku to: %s%n%nKilknij OK jeśli chcesz przeanalizować plik samodzielnie lub Anuluj aby wyjść.
97=%s%nma nieznane rozszerzenie i nie może być wypakowany.
98=%s%nnie można utworzyć. Wybierz odpowiedni folder.
99=%s nie można wypakować.%nWydaje się być %s, ale wypakowywanie nie powiodło się.%nSprawdź plik log, %s, aby uzyskać więcej informacji.%n%nKliknij OK aby zobaczyć plik log teraz lub Anuluj aby wyjść.
100=%t–= %s analizy =–
; Update messages
101=Aktualizacja zakończona
102=Aktualizacja rozpoczęta, proszę czekać...
103=Pobieranie plików
104=Pobieranie zakończone!
105=Aktualizacja do wersji: %s
106=%n%s zostanie uruchomiony ponownie!
107=Twoja bieżąca wersja: %s%nAktualizacja nie jest wymagana!
; ------------------------------------
108=Błąd pobierania
109=Nie można wczytać listy plików z serwera.%nPołączenie sieciowe może być odłączone%nlub serwer aktualizacji jest niedostępny.
110=Nie udało się pobrać pliku
111=Błąd rozpakowywania pliku
112=Podczas aktualizacji do wersji: %s%nwystąpił błąd, powtarzam!!!
113=Zakończono: %s z %s
114=Informacja
115=Wersje dekompresorów
116=Otworzyć folder rozpakowania?
117=Wiersz w tabeli
118=Separator
119=Otwórz tylko górny po&ziom archiwum
120=Analizowanie plików PE
121=Nie można przetworzyć pliku .msi
122=Ze względu na "głębokie" położenie pakietu MSI nie można pobrać pliku(ów) %s.%nAby uzyskać szczegółowe informacje zobacz w %s.%n%nPrzenieś pakiet MSI bliżej do katalogu głównego dysku, a następnie spróbuj ponownie.%n%nKliknij przycisk 'OK', aby wyświetlić plik dziennika, lub przycisk 'Anuluj', aby wyjść.
123=sygnatury -
124=Wybrać typy archiwów ręcznie (z listy) ?
125=Wybierz sygnatury prawdopodobnego pliku archiwum
126=Spróbować pobrać 'TotalObserver' ?